src/InformationRegisters/КритическиеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КритическиеОстатки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Минимальное количество номенклатуры</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Comment>Упаковка для данного вида номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Comment>Содержит список складов и сотрудников (номенклатура может хранится у сотрудника)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Сотрудник является клиентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>APIВес</Name>
					<Comment>Вес сотрудника для API, сначала выводятся более тяжелые</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность сотрудника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОМС</Name>
					<Comment>Код по ОМС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинОнЛайнКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДляСайтаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольОнЛайнКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДляОнлайнЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольПользователя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПользовательИБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпецилазацииСотрудника</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Comment>Специализация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Comment>Основная специализация</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеКассы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Касса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСтруктурныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСтруктурныеЕдиницыЖурналаЗаписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/КритическиеОстатки/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Ключ.СтруктурнаяЕдиница) Тогда
		Запись.СтруктурнаяЕдиница = Параметры.Ключ.СтруктурнаяЕдиница;
	ИначеЕсли Параметры.Свойство("СтруктурнаяЕдиница") Тогда
		Запись.СтруктурнаяЕдиница = Параметры.СтруктурнаяЕдиница;
	Иначе
		Запись.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	Если Параметры.ЗначенияЗаполнения.Свойство("СтруктурнаяЕдиница") 
	 И Параметры.ЗначенияЗаполнения.Свойство("Склад") 
	 И Параметры.ЗначенияЗаполнения.Свойство("Номенклатура") Тогда
		Запись.СтруктурнаяЕдиница = Параметры.ЗначенияЗаполнения.СтруктурнаяЕдиница;
		Запись.Склад = Параметры.ЗначенияЗаполнения.Склад;
		Запись.Номенклатура = Параметры.ЗначенияЗаполнения.Номенклатура;
		Если Параметры.ЗначенияЗаполнения.Свойство("Партия") Тогда
			Запись.Партия = Параметры.ЗначенияЗаполнения.Партия;
		КонецЕсли;
		ЭтаФорма.Элементы.Номенклатура.Видимость = Истина;
	КонецЕсли;
	Если Параметры.Свойство("Номенклатура") И Параметры.Свойство("Склад") Тогда
		Запись.Номенклатура = Параметры.Номенклатура;
		Если Параметры.Свойство("Партия") Тогда
			Запись.Партия = Параметры.Партия;
		КонецЕсли;
		ЭтаФорма.Элементы.Номенклатура.Видимость = Истина;
		Запись.Склад = Параметры.Склад;
	КонецЕсли;
	Если (ЗначениеЗаполнено(Параметры.Ключ.Номенклатура) И ЗначениеЗаполнено(Параметры.Ключ.Склад)) ИЛИ Параметры.Свойство("УстановкаКритОстатков")
	 ИЛИ Параметры.Свойство("ДобавлениеНового") Тогда
		ЭтаФорма.Элементы.Номенклатура.Видимость = Истина;
	КонецЕсли;
	Если Параметры.Свойство("СпрНоменклатура") Тогда
		Запись.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		Запись.Номенклатура = Параметры.СпрНоменклатура;
		ЭтаФорма.Элементы.Номенклатура.Видимость = Истина;
	КонецЕсли;

	Если НЕ Параметры.Ключ.Номенклатура.Пустая() И НЕ Параметры.Ключ.Склад.Пустая() Тогда
		ПризнакКомандаИзменить = Истина;
	КонецЕсли;
	
	Если Не ПроверитьГруппу(Запись.Номенклатура) Тогда	
		Если Запись.Номенклатура.ИспользоватьПартии Тогда
			Элементы.Партия.Видимость = Истина;
		КонецЕсли;
	Иначе 
		Запись.Номенклатура = Неопределено;
		Модифицированность = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='В номенклатуре была указана группа. Пожалуйста, укажите единицу номенклатуры';en='The group was indicated in the nomenclature. Please indicate unit of nomenclature'"));
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КритическиеОстатки.Номенклатура,
	                      |	КритическиеОстатки.Склад
	                      |ИЗ
	                      |	РегистрСведений.КритическиеОстатки КАК КритическиеОстатки
	                      |ГДЕ
	                      |	КритическиеОстатки.Номенклатура = &Номенклатура
	                      |	И КритическиеОстатки.Склад = &Склад
	                      |	И КритическиеОстатки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                      |	И КритическиеОстатки.Партия = &Партия");
	
	Запрос.УстановитьПараметр("Номенклатура"      	, ТекущийОбъект.Номенклатура);
	Запрос.УстановитьПараметр("Партия"				, ТекущийОбъект.Партия);
	Запрос.УстановитьПараметр("Склад"             	, ТекущийОбъект.Склад);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, ТекущийОбъект.СтруктурнаяЕдиница);
	
	Если НЕ Запрос.Выполнить().Пустой() и НЕ ПризнакКомандаИзменить Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Для данного склада критический остаток по выбранной номенклатуре уже существует.';en='For this warehouse critical the remainder for the selected nomenclature already exists.'"));
	КонецЕсли;
	
	Если ТипЗнч(Запись.Склад) = Тип("СправочникСсылка.Сотрудники") Тогда
		ЗапросСотрудник = Новый Запрос;
		ЗапросСотрудник.Текст = "ВЫБРАТЬ
		                        |	Сотрудники.Ссылка КАК Сотрудник
		                        |ИЗ
		                        |	Справочник.Сотрудники КАК Сотрудники
		                        |ГДЕ
		                        |	Сотрудники.МестаРаботы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		                        |	И Сотрудники.Ссылка = &Сотрудник";
		ЗапросСотрудник.УстановитьПараметр("СтруктурнаяЕдиница",Запись.СтруктурнаяЕдиница);
		ЗапросСотрудник.УстановитьПараметр("Сотрудник",Запись.Склад);
		Результат = ЗапросСотрудник.Выполнить().Выгрузить();
		
		Если Результат.Количество() = 0 Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выбранный сотрудник не работает в данной структурной единице.';en='Selected employee does not work in this structural unit.'"));
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма.Прочитать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "Создание" поля "Упаковка".
//
Процедура УпаковкаСоздание(Элемент, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Номенклатура не заполнена';en='Nomenclature is not filled'"));		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Создание списка значений для быстрого выбора упаковки номенклатуры.
//
Процедура УпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// вставка параметра для отбора упаковок по номенклатуре
	Номенклатура = Новый Структура;
	Номенклатура.Вставить("Номенклатура", Запись.Номенклатура);
	// процедура формирования списка
	ОбработкаТабличныхЧастейКлиент.ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, Номенклатура);
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора" поля "Номенклатура".
//
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Параметр = Новый Структура("ЭтоЗапас", Истина);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора", Параметр,,,,, Новый ОписаниеОповещения("НоменклатураНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора" поля "Партия".
//
Процедура ПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		
		ПараметрыВыбора = Новый Структура;	
		ПараметрыВыбора.Вставить("Номенклатура"      , Запись.Номенклатура);
		ПараметрыВыбора.Вставить("Склад"             , Запись.Склад);
		ПараметрыВыбора.Вставить("СтруктурнаяЕдиница", Запись.СтруктурнаяЕдиница);
		ПараметрыВыбора.Вставить("Дата"              , ТекущаяДата());
		ПараметрыВыбора.Вставить("МножественныйВыбор", Ложь);
		ПараметрыВыбора.Вставить("ОтборРежимОтбора"  , 2);
		
		ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаВыбора", ПараметрыВыбора,,,,, Новый ОписаниеОповещения("ПартияНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);		
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "ЗаписатьИЗакрыть".
//
Процедура ЗаписатьИЗакрыть(Команда)
	
	ФормаЗаписана = Истина;
	ЭтаФорма.Записать();
	ЭтаФорма.Закрыть(Новый Структура("ФормаЗаписана", ЭтотОбъект.ФормаЗаписана));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Скрыть показать дополнительно
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СкрытьПоказатьДополнительно(Команда)
	
	Элементы.ГруппаДополнительно.Видимость = НЕ Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НоменклатураНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ВыбранныйЭлемент = Результат;
	
	Если ЗначениеЗаполнено(ВыбранныйЭлемент) И НЕ ПроверитьГруппу(ВыбранныйЭлемент) Тогда
		Запись.Номенклатура = ВыбранныйЭлемент;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПартияНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено и Результат.Количество() <> 0 Тогда
		Запись.Партия = Результат[0];
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
// Функция, обработчик события "ПроверитьГруппу".
//
Функция ПроверитьГруппу(Ссылка)
	
	Возврат Ссылка.ЭтоГруппа;	
	
КонецФункции


#КонецОбласти
